Breeder_1.5/libraries/groovyBC/Demos/circulatingSplash/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor        
    {
        type            zeroGradient;
    }

    sides       
    {
        type            zeroGradient;
//         type            inletOutlet;
//         inletValue      uniform 0;
//         value           uniform 0;
        //        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             none;
        psi             none;
        gamma           1;
        value           uniform 0;
    }

    spill       
    {
        type            zeroGradient;
//         type            inletOutlet;
//         inletValue      uniform 0;
//         value           uniform 0;
        //        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             none;
        psi             none;
        gamma           1;
        value           uniform 0;
    }

    atmosphere      
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             none;
        psi             none;
        gamma           1;
        value           uniform 0;
        // type groovyBC;
         valueExpression "0";
         gradientExpression "0";
         fractionExpression "(gamma>0.01) ? 1 : 0";
    }
}

// ************************************************************************* //
